#include <iostream>
//MakarevichKirill2006
//МакаревичКириллВитальевич2006
//Макаревич2006Kirill

// задание 10
/* 77 97 107 97 114 101 118 105 99 104 75 105 114 105 108 108 50 48 48 54 */
/* 204 224 234 224 240 229 226 232 247 202 232 240 232 235 235 194 232 242 224 235 252 229 226 232 247 50 48 48 54*/
/* 204 224 234 224 240 229 226 232 247 50 48 48 54 75 105 114 105 108 108 */

// задание 11
//utf-8
/* 4D 61 6B 61 72 65 76 69 63 68 4B 69 72 69 6C 6C 32 30 30 36 */
/*D0 9C D0 B0 D0 BA D0 B0 D1 80 D0 B5 D0 B2 D0 B8 D1 87 D0 9A D0 B8 D1 80 D0 B8 D0 BB D0 BB D0 92 D0 B8 D1 82 D0 B0 D0 BB D1 8C D0 B5 D0 B2 D0 B8 D1 87 D1 87 32 30 30 36 */
/*D0 9C D0 B0 D0 BA D0 B0 D1 80 D0 B5 D0 B2 D0 B8 D1 87 32 30 30 36 4B 69 72 69 6C 6C */
//utf-16
/* 00 4D 00 61 00 6B 00 61 00 72 00 65 00 76 00 69 00 63 00 68 00 4B 00 69 00 72 00 69 00 6C 00 6C 00 32 00 30 00 30 00 36 */
/* 04 1C 0430 0430 0440 0435 0432 0438 0447 041A 0438 0440 0438 043B 043B 0412 0438 0442 0430 043B 044C 0435 0432 0438 0447 0437 0032 0030 0030 0036 */
/* 00 4D 00 61 00 6B 00 61 00 72 00 65 00 76 00 69 00 63 00 68 00 32 00 30 00 30 00 36 00 4B 00 69 00 72 00 69 00 6C 00 6C */
int main() {
    int number = 0x12345678;
    char hello[] = "Hello, ";
    char lfie[] = "MakarevichKirill2006";
    char rfie[] = "МакаревичКирилл2006";
    char lr[] = "Макаревич2006Kirill";

    wchar_t Lfie[] = L"MakarevichKirill2006";
    wchar_t Rfie[] = L"МакаревичКирилл2006";
    wchar_t LR[] = L"Макаревич2006Kirill";

    std::cout << hello << lfie << std::endl;
    return 0;
}
